from unittest import TestCase, main
from rk import task1, task2, task3
 
class testrk2(TestCase):
    def test_task1(self):
        self.assertEqual(task1(
            [('МИРОВАЯ СТРОЙКА', 111000, 'Шайба', 'Ш3.1', 3),
             ('СТРОИТЕЛЬНЫЙ МИР', 980000, 'Шуруп', 'Ш2.2', 2),
             ('КВАДРАТ К КУБЕ', 354000, 'Болт', 'Б5', 4),
             ('ХОЗМАГ', 4850000, 'Болт', 'Б5', 4),
             ('СТРОЙМАГ', 145000, 'Гайка', 'ГГ', 1),
             ('Магнит', 3457000, 'Шуруп', 'Ш2.2', 2),
             ('Дикси', 2240000, 'Заглушка', 'З1', 6)]),
 
            [('ХОЗМАГ', 4850000, 'Болт', 'Б5', 4),
             ('Магнит', 3457000, 'Шуруп', 'Ш2.2', 2),
             ('Дикси', 2240000, 'Заглушка', 'З1', 6),
             ('СТРОИТЕЛЬНЫЙ МИР', 980000, 'Шуруп', 'Ш2.2', 2),
             ('КВАДРАТ К КУБЕ', 354000, 'Болт', 'Б5', 4),
             ('СТРОЙМАГ', 145000, 'Гайка', 'ГГ', 1),
             ('МИРОВАЯ СТРОЙКА', 111000, 'Шайба', 'Ш3.1', 3)])
 
    def test_task2(self):
        self.assertEqual(task2(
            [('МИРОВАЯ СТРОЙКА', 111000, 'Шайба', 'Ш3.1', 3),
             ('СТРОИТЕЛЬНЫЙ МИР', 980000, 'Шуруп', 'Ш2.2', 2),
             ('КВАДРАТ К КУБЕ', 354000, 'Болт', 'Б5', 4),
             ('ХОЗМАГ', 4850000, 'Болт', 'Б5', 4),
             ('СТРОЙМАГ', 145000, 'Гайка', 'ГГ', 1),
             ('Магнит', 3457000, 'Шуруп', 'Ш2.2', 2),
             ('Дикси', 2240000, 'Заглушка', 'З1', 6)]),
 
            [('Шуруп', 2),
('Болт', 2),
('Гайка', 1),
('Шайба', 1),
('Заглушка', 1)])
 
    def test_task3(self):
        self.assertEqual(task3(
            [('Гвоздь', 0, 'СТРОЙМАГ'),
              ('Болт', 4, 'СТРОЙМАГ'),
              ('Заглушка', 6, 'СТРОЙМАГ'),
              ('Гвоздь', 0, 'СТРОИТЕЛЬНЫЙ МИР'),
              ('Шайба', 3, 'СТРОИТЕЛЬНЫЙ МИР'),
              ('Болт', 4, 'СТРОИТЕЛЬНЫЙ МИР'),
              ('Гвоздь', 0, 'МИРОВАЯ СТРОЙКА'),
              ('Заглушка', 6, 'МИРОВАЯ СТРОЙКА'),
              ('Гайка', 1, 'КВАДРАТ К КУБЕ'),
              ('Шуруп', 2, 'КВАДРАТ К КУБЕ'),
              ('Заглушка', 6, 'КВАДРАТ К КУБЕ'),
              ('Шуруп', 2, 'ХОЗМАГ'),
              ('Болт', 4, 'ХОЗМАГ'),
              ('Шестеренка', 5, 'ХОЗМАГ'),
              ('Шуруп', 2, 'Магнит'),
              ('Шайба', 3, 'Дикси'),
              ('Шестеренка', 5, 'Дикси'),
              ('Заглушка', 6, 'Дикси')]),


            {'Гвоздь': ['СТРОЙМАГ', 'СТРОИТЕЛЬНЫЙ МИР', 'МИРОВАЯ СТРОЙКА'],
             'Гайка': ['КВАДРАТ К КУБЕ'],
             'Шуруп': ['КВАДРАТ К КУБЕ', 'ХОЗМАГ', 'Магнит'],
             'Шайба': ['СТРОИТЕЛЬНЫЙ МИР', 'Дикси'],
             'Болт': ['СТРОЙМАГ', 'СТРОИТЕЛЬНЫЙ МИР', 'ХОЗМАГ'],
             'Шестеренка': ['ХОЗМАГ', 'Дикси'],
             'Заглушка': ['СТРОЙМАГ', 'МИРОВАЯ СТРОЙКА', 'КВАДРАТ К КУБЕ', 'Дикси']})
 
if __name__ == "__main__":
    main()
